app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "xfhr"], ["text", "rhrx"], ["created_at", "2023-02-16 21:39:11.927124"], ["updated_at", "2023-02-16 21:39:11.927124"]]

  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "text" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "fffffffffffffffffffffffffff"], ["text", "gggggggggggggggggg"], ["updated_at", "2023-02-16 22:03:42.250507"], ["id", 4]]

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 4]]